class_name FactionSystem
extends RefCounted

const FACTIONS := {
	"doomed": {
		"name": "Обречённые",
		"members": ["arseniy", "danill", "dasha", "shoji", "milena", "naama", "rimes", "musienko", "jeff", "valramors"],
		"desc_tiers": {
			2: "Все персонажи в отряде получают +15% Крит. шанса.",
			3: "Все персонажи в отряде получают +30% Крит. шанса.",
			4: "Все персонажи в отряде получают +30% Крит. шанса, а Сверхспособности Обречённых полностью заряжены на старте."
		}
	},
	"chaos": {
		"name": "Рассвет Хаоса",
		"members": ["arseniy", "danill", "dasha", "shoji", "kaori", "milena", "naama", "lenskaya", "rimes", "musienko", "valramors"],
		"desc_tiers": {
			2: "Сила атаки (СА) и макс. ХП участников Рассвета Хаоса повышены на 15%.",
			4: "СА и ХП участников повышены на 15%, а их действия продвигаются на 50% в начале боя."
		}
	},
	"empyreans": {
		"name": "Эмпирейцы",
		"members": ["dotseva", "marina", "pusenkov", "sara", "vika", "isaac", "keloist", "joan", "joan_spirit", "katarina", "dotseva_crimson_tears"],
		"desc_tiers": {
			2: "Сила атаки Эмпирейцев увеличена на 30%.",
			4: "Сила атаки Эмпирейцев увеличена на 30%, а их Крит. шанс становится равен 100% на первые 4 хода боя."
		}
	},
	"academy": {
		"name": "Академия",
		"members": ["dotseva", "vika", "sara", "isaac"],
		"desc_tiers": {
			1: "+1 Очко навыков (ОН) в начале боя",
			2: "+1 ОН на старте, скорость всех союзников повышена на 8%.",
			3: "+1 ОН на старте, скорость союзников +8%. При получении лечения или щита персонаж наносит на 30% больше урона на 2 хода."
		}
	},
	"console": {
		"name": "Консоль",
		"members": ["isaac_admin", "sara_admin", "arseniy_admin", "dasha_admin", "shoji_swan"],
		"desc_tiers": {
			2: "Синхронизация протокола: Скорость всех участников Консоли повышена на +10%.",
			4: "Полный доступ: Все участники начинают бой с +15 Векторами, а их Бинарный урон повышен на +20%."
		}
	},
}
